"use client"
export default function RulesComponent() {
  return (
   
        <div className="bg-white/90 backdrop-blur-sm rounded-2xl p-8 shadow-lg border border-orange-200">
        <style jsx>{`
        .text-fruit-gradient {
          background: linear-gradient(45deg, #F871A0, #F97316);
          -webkit-background-clip: text;
          -webkit-text-fill-color: transparent;
        }
      `}</style>
          <div className="text-gray-600 mb-6">
          本規約は、お魚通販.com株式会社（以下「当社」）が提供する買取サービス（以下「本サービス」）における利用条件を定めるものです。本サービスを利用するお客様（以下「お客様」）には本規約に従い本サービスをご利用いただきます。また、当社ホームページより買取りのお申込みをいただくか、買取目的物（以下「商品」）をお送りいただいた時点で本規約に同意したものといたします。
          </div>
          <div className="mb-6">
            <h3 className="text-lg font-bold mb-2">第1条 適用</h3>
            <div className="m-2 ">
              <div>1. 本規約は、お客様と当社との間の本サービスの利用に関わる一切の関係に適用されるものとします。</div>
              <div>2. 当社は、本サービスに関し、本規約のほかご利用にあたってのルール等、各種の定め（以下、「個別規定」）をすることがあります。これら個別規定はその名称のいかんに関わらず、本規約の一部を構成するものとします。</div>
              <div>3. 当社は、お客様が指定された振込先に買取金額を振り込むこと、また通知義務のある場合はお客様が登録したメールアドレスへ通知を発信する事により、お客様への義務を果たすものとします。</div>
              <div>4. 本規約の規定が前条の個別規定と矛盾する場合には、個別規定において特段の定め無き限り、個別規定の規定が優先されるものとします。</div>
            </div>
          </div>
          <div className="mb-6">
            <h3 className="text-lg font-bold mb-2">第2条 利用方法</h3>
            <div className="m-2 ">
              <div>1. 本サービスにおいては、お客様が本規約に同意の上、当社の定める方法によって申込みをし、当社がこれを承認することによって利用できるものとします。</div>
              <div>2. 当社は、利用申込みに以下の事由があると判断した場合、利用をお断りする場合があり、その理由については一切の開示義務を負わないものとします。
                <ul className="list-disc list-inside list-none m-2">
                  <li>(1)申込みに際して虚偽の事項を届け出た場合</li>
                  <li>(2)本規約に違反したことがある者からの申込みである場合</li>
                  <li>(3)その他、当社が利用を相当でないと判断した場合</li>
                </ul>
              </div>
            </div>
          </div>
          <div className="mb-6">
            <h3 className="text-lg font-bold mb-2">第3条 利用規約の改訂</h3>
            <div className="m-2 ">
              <div>1. 当社は、本規約について社会情勢の変化等に対応し、当社が相当と認める場合は、いつでもお客様に許可なく本規約を変更・改訂できるものとします。</div>
              <div>2. 本規約改訂は、当社ホームページ上に告知した時点で効力を生ずるものとします。<br />なお、本規約改訂後、本サービスの利用を開始した場合には当該お客様は改訂後の規約に同意したものとみなします。</div>
            </div>
          </div>
          <div className="mb-6">
            <h3 className="text-lg font-bold mb-2">第4条 本サービスにおける商品</h3>
            <div className="m-2 ">
              <p className="my-2">お客様が本サービスを利用して買取りをお申込みされる商品は当社が承諾するものでなければなりません。本サービスを利用するお客様は以下の事由を了承の上申し込みをしたものとします。</p>
              <div>1. お客様が当社に売却していただく商品を自らの意思で各ギフト券の発行会社が定める正規販売店で適正に購入していること。</div>
              <div>2. お客様と当社との売買に関連する商品の購入及び売却に際し、お客様は当社及び第三者から強要又は強制を受けて当社を利用していないこと。</div>
              <div>3. 商品の買取成立前や後に関わらず、当該商品の有効性を確認する為に当社から連絡する場合があること。その有効性を証明できる当該商品のデータ原本等を提示できるように保持すること。また、当社の求めに応じそれらを提示すること。</div>
              <div>4. 前項の提示ができずギフト券の有効性が証明できない場合は、当該商品は不良（使用済み、無効やロックなど有効ではないもの）と判断されること。</div>
              <div>5. 当社が買い取った商品はクーリングオフの対象となるものではないこと。</div>
              <div>6. 当社は、一度買取った商品の返還にはいかなる理由があっても応じないこと</div>
              <div>7.本サービスを利用して買取りさせていただいた商品に不良があった時または、当社が提示した買取り金額とお支払いした金額に差異があったとき（当社の振込間違いも含む）には、お客様は買取り代金の全額または、差額の返還など当社の指示に速やかに従うものとします。また、万一お客様とご連絡がつかなかった場合は、次回買取時に無条件で買取金額と返金金額を相殺することに対し、お客様は予め同意するものとします。</div>
              <div>8. お客様が本サービスを利用して買取りをお申込みされる商品は、盗品その他犯罪行為により取得したものではなく、お客様が合法的に売却する権限を有する商品であるものとします。</div>
              <div>9. 本サービスのご利用にあたり、発生した通信費等はお客様の自己負担となります。</div>
              <div>10. 当社によるお客様への商品相当額の銀行振込による送金が完了した時点で該当商品に関する売買契約が成立したものとし、商品の所有権がお客様から当社に移転します。</div>
              <div>11. 所有権移転後はいかなる場合であっても、第三者に商品情報を意図的に流出させること及び、商品の使用を固く禁止するものとします。</div>
              <div>12. 当社に商品を送信した後は、キャンセルをお受けできないこと。</div>
              <div>13. １度の申込みが額面で合計3,000円以上であること。</div>
              <div>14 .初回のお申込みは当ホームページトップに記載されている上限額を上回らないこと。</div>
              <div>15. Amazonギフトカードは、種類別商品券ではないこと。(万が一お申込みいただいた場合、ギフト券の返却及び買取代金の支払いには一切応じません。)</div>
              <div>16. NANACOギフト券は、【セブンネット限定】または【EJOICAセレクトギフト】ではないこと。(万が一お申込みいただいた場合、ギフト券の返却及び買取代金の支払いには一切応じません。)</div>
              <div>17. QUOカードPayは、利用先を限定されているQUOカードPayではなく、共通のQUOカードPayであること。(万が一お申込みいただいた場合、ギフト券の返却及び買取代金の支払いには一切応じません。)</div>
              <div>18. WebMoneyは、特定加盟店専用タイプの種類ではないこと。(万が一お申込みいただいた場合、ギフト券の返却及び買取代金の支払いには一切応じません。)</div>
              <div>19. 日本で使用することを前提として発行されている商品であること。</div>
              <div>20. 買取後のギフトカードまたはギフトカードの残高が、無効化、ロック、保留、停止等、使用できない状態になった場合、当該商品は不良と判断されること。</div>
            </div>
          </div>
          <div className="mb-6">
            <h3 className="text-lg font-bold mb-2">第5条 支払い</h3>
            <div className="m-2 ">
              <div>1. 当社は、当社が承諾した商品をお客様から当サイトの申込みフォーム（若しくは当社のギフト券登録フォーム）からの送信により買取り、お客様に商品相当額をお客様が指定したご本人様名義の銀行口座に振り込む方法で買取金額を支払います。</div>
              <div>2. 振込までの時間の目安は当ホームページ上に記載します。
              但し、初回・大口（10万円以上）・1日に複数のお申込・過去に不良の商品（エラーギフト券・使用済み・無効など有効ではないギフト券）を送信したお客様・商品数が多い（5件以上）その他の理由によりホームページ上に記載されている時間より多くの時間がかかる場合があります。</div>
              <div>3. 本サービスの申込み内容に相違（申し込み回数の違い、申込み額面の違いなど）がある場合、当社はお客様の承諾なしに該当の買取率に変更できることをお客様は予め同意するものとします。</div>
              <div>4. 金融機関のメンテナンス、その他不可抗力の事情により金融機関への着金が遅延した場合でも当社は一切責任を負いかねます。</div>
            </div>
          </div>
          <div className="mb-6">
            <h3 className="text-lg font-bold mb-2">第6条 禁止行為</h3>
            <div className="m-2 ">
              <p className="my-2">本サービスの利用にあたり、お客様は以下の行為を行ってはならないものとします。</p>
              <div>1. 法令に違反する行為</div>
              <div>2. ご利用の際に虚偽の内容を申請する行為または他者になりすましてサービスを利用したり、情報を改ざんする行為</div>
              <div>3. 18歳未満の方、若しくは高校生のご利用</div>
              <div>4. 犯罪予告、犯罪の指南等、犯罪を引き起こすおそれのある行為</div>
              <div>5. 無効な商品を送付する行為（無効である事実を知りながら送付する行為を含む）、商品（ギフトコード）を二重に送付する行為（前後を問わず当サイトに送付した商品を他社買取サイトにも送付する行為）及び商品（ギフトコード）を第三者に開示する行為</div>
              <div>6. 不正取得した商品を送付する行為、商品が不正取得された事実を知りながら送付する行為</div>
              <div>7. 当社のシステム等に過度な負荷をかける行為、不正アクセス又は不正なアクセスを試みる行為</div>
              <div>8. 反社会的勢力等の活動を助長または反社会的勢力等に利益を供与する行為</div>
              <div>9. 当社（従業員を含む）に対する誹謗中傷、脅迫、強要等の行為</div>
              <div>10. 当社の著作権、商標権その他の知的財産権を含む一切の財産的権利等を侵害する行為</div>
              <div>11. 本サービスの運営を妨害する行為</div>
              <div>12. 各ギフト券の発行会社が定める正規販売店以外で購入したギフト券、第三者から譲渡されたギフト券を申し込む行為</div>
              <div>13. その他、当社が不適当と判断する行為</div>
            </div>
          </div>
          <div className="mb-6">
            <h3 className="text-lg font-bold mb-2">第7条 本規約違反等への対処</h3>
            <div className="m-2 ">
              <div>
                1.当社はお客様が本規約に違反した場合、お客様の本サービスの利用に関して他者からクレーム・請求等が為され、かつ当社が必要と認めた場合、又はその他の理由で本サービスの運営上不適当と判断した場合は当該お客様に対し、次のいずれか又はこれらを組み合わせた措置を講ずることがあります。
                <ul className="list-disc list-inside list-none m-2">
                  <li>(1) 本規約に違反する行為の停止を要求します。</li>
                  <li>(2) クレーム・請求等の解消のための協議を行うことを要求します。</li>
                  <li>(3) 当該違反行為による損害の請求をいたします。</li>
                  <li>(4) 本サービスの利用停止処分とします。</li>
                </ul>
              </div>
              <div>2. お客様は、前項の規定は当社に同項に定める措置を講ずべき義務を課すものではないことを承諾します。また、お客様は当社が前項各号に定める措置を講じたことに起因する結果に関し、当社を免責するものとします。</div>
            </div>
          </div>
          <div className="mb-6">
            <h3 className="text-lg font-bold mb-2">第8条 本サービスの提供の停止等</h3>
            <div className="m-2 ">
              <div>
                1.当社は、以下のいずれかの事由があると判断した場合、お客様に事前に通知することなく本サービスの全部または一部の提供を停止や変更または中断することができるものとします。
                <ul className="list-disc list-inside list-none m-2">
                  <li>(1) 本サービスにかかるコンピュータシステムの保守点検または更新を行う場合</li>
                  <li>(2) 地震・落雷・火災・停電または天災などの不可抗力により本サービスの提供が困難となった場合</li>
                  <li>(3) コンピュータまたは通信回線等が事故により停止した場合</li>
                  <li>(4) その他当社が本サービスの提供が困難と判断した場合</li>
                </ul>
              </div>
              <div>2. 当社は、本サービスの提供の停止または中断によりお客様または第三者が被ったいかなる不利益または損害についても一切の責任を負わないものとします。</div>
            </div>
          </div>
          <div className="mb-6">
            <h3 className="text-lg font-bold mb-2">第9条 保証の否認及び免責事項</h3>
            <div className="m-2 ">
              <div>1. 当社は、本サービスに事実上または法律上の瑕疵（安全性・信頼性・正確性・完全性・有効性・特定の目的への適合性・セキュリティなどに関する欠陥・エラーやバグ・権利侵害などを含みます。）がないことを明示的にも黙示的にも保証しておりません。</div>
              <div>2. 当社は、本サービスに起因してお客様に生じたあらゆる損害について一切の責任を負いません。ただし、本サービスに関する当社とお客様との間の契約（本規約を含みます。）が消費者契約法に定める消費者契約となる場合、この免責規定は適用されません。</div>
              <div>3. 前項ただし書に定める場合であっても、当社は、当社の過失（重過失を除きます。）による債務不履行または不法行為によりお客様に生じた損害のうち特別な事情から生じた損害（当社またはお客様が損害発生につき予見し、または予見し得た場合を含みます。）について一切の責任を負いません。</div>
              <div>4. お客様が本サービスを通じて得る情報等について、当社はいかなる保証も行わず、お客様が当該情報を利用して損害を被った場合であっても当社はその被った損害について賠償するいかなる責を負わないものとします。</div>
              <div>5. お客様が当社又は第三者に対し損害を与えた場合、お客様は自己の責任と費用により当該損害を賠償する責を負うものとします。</div>
              <div>6. 当社は、本サービスに関してお客様と他のお客様または第三者との間において生じた取引、連絡または紛争等について一切責任を負いません。</div>
              <div>7. 本サービスのシステム運営に伴い、ネットワークやシステム不具合、遅延、停止又はデータの消失がないことを一切保証しないものとします。</div>
            </div>
          </div>
          <div className="mb-6">
            <h3 className="text-lg font-bold mb-2">第10条 個人情報の取扱い</h3>
            <div className="m-2 ">
              <div>1. 当社は、本サービスの利用によって取得する個人情報について当社「プライバシーポリシー」に従い適切に取り扱うものとします。</div>
            </div>
          </div>
          <div className="mb-6">
            <h3 className="text-lg font-bold mb-2">第11条 通知または連絡</h3>
            <div className="m-2 ">
              <div>1. お客様と当社との間の通知または連絡は、当社の定める方法によって行うものとします。当社は、お客様から当社が別途定める方式に従った変更届出がない限り、現在登録されている連絡先が有効なものとみなして当該連絡先へ通知または連絡を行い、これらは発信時にお客様へ到達したものとみなします。</div>
            </div>
          </div>
          <div className="mb-6">
            <h3 className="text-lg font-bold mb-2">第12条 権利義務の譲渡の禁止</h3>
            <div className="m-2 ">
              <div>1. お客様は、当社の書面による事前の承諾なく利用契約上の地位または本規約に基づく権利もしくは義務を第三者に譲渡し、または担保に供することはできません。</div>
            </div>
          </div>
          <div className="mb-6">
            <h3 className="text-lg font-bold mb-2">第13条 合意管轄</h3>
            <div className="m-2 ">
              <div>1. お客様は本サービスに関する一切の紛争（裁判所の調停手続きを含む）は、東京地方裁判所を第一審の専属的合意管轄裁判所とすることに合意するものとします。</div>
            </div>
          </div>
          <div className="mb-6">
            <h3 className="text-lg font-bold mb-2">第14条 準拠法</h3>
            <div>
              <div>1.本規約の解釈にあたっては、日本法を準拠法とします。</div>
            </div>
          </div>
        </div>
  );
}